Tekla Open API Reference for Tekla Structures 2025
Frame Properties
The Frame type exposes the following members.
Properties
Name | Description
Color
 The frame's color.
TrueColor
 The true color (RGB enabled) of the frame.
Type
 The frame's type (square, round, dashed...).
Top
See Also
Reference
Frame Class
Tekla.Structures.Drawing Namespace